In [2]:
import numpy as np
import pandas as pd
import json
import requests
cities=pd.read_csv('dests.txt', header=None)
api_key='AIzaSyDHckTnJuE1ZTF84gW8Iq6uBqc7ODiJKog'
cities

           0
0   Istanbul
1  Amsterdam
2   Valletta
3      Basel
4       Doha

In [16]:
data = pd.DataFrame(columns=['Target', 'Distance_km', 'Duration (hour+minutes)', 'Longitude', 'Latitude'])
for des in cities.values:
    url="https://maps.googleapis.com/maps/api/geocode/json?address=%s&key=%s" % (des,api_key)
    try:
        response = requests.get(url)
        if response.status_code != 200:
            raise ValueError(f"Something went wrong with requests.get of: {des}")
        else:
            res=response.json()
            lat=res['results'][0]['geometry']['location']['lat']
            lng=res['results'][0]['geometry']['location']['lng']
            url_dis="https://maps.googleapis.com/maps/api/distancematrix/json?origins=%s&destinations=%s&key=%s" % ('Tel Aviv',des,api_key)
            response_dis = requests.get(url_dis)
            res_dis=response_dis.json()
            distance=res_dis['rows'][0]['elements'][0]['distance']['value']/1000
            hours,minutes=divmod(res_dis['rows'][0]['elements'][0]['duration']['value']/60,60)
            duration= f"{int(hours)} hours and {int(minutes)} minutes"
            new_row = {'Target': des[0], 'Distance_km': distance, 'Duration (hour+minutes)': duration, 'Longitude': lng, 'Latitude': lat}
            data = data.append(new_row,ignore_index=True)
    except ValueError as err:
        print(err)

In [17]:
data

      Target  Distance_km  Duration (hour+minutes)  Longitude   Latitude
0   Istanbul     1815.227   21 hours and 2 minutes  28.978359  41.008238
1  Amsterdam     4532.541   48 hours and 3 minutes   4.904139  52.367573
2   Valletta     3792.883  50 hours and 52 minutes  14.514100  35.899237
3      Basel     4092.805   44 hours and 2 minutes   7.588576  47.559599
4       Doha     2164.477  22 hours and 38 minutes  51.531040  25.285447

In [18]:
three_furthest=data.nlargest(3,'Distance_km')
three_furthest

      Target  Distance_km  Duration (hour+minutes)  Longitude   Latitude
1  Amsterdam     4532.541   48 hours and 3 minutes   4.904139  52.367573
3      Basel     4092.805   44 hours and 2 minutes   7.588576  47.559599
2   Valletta     3792.883  50 hours and 52 minutes  14.514100  35.899237